package com.book.beinglogical;

import com.book.AbstractBook;

public class BeingLogicalBook extends AbstractBook{

	public static void main(String[] args) {
		/**
		 * 书籍结构
		 * 第一章:准备
		 * 		建立逻辑思维的框架
		 * 第二章:逻辑思维的基本原理
		 * 		逻辑思维框架中的一些定义和使用框架的技巧
		 * 第三章:逻辑思维的具体表现.
		 * 		????
		 * 第四章:非逻辑思维的根源
		 * 		????
		 * 第五章:非逻辑思维的主要形式.
		 * 		????
		 * */
		
		/**
		 * 阅读思考
		 * 1:描述需要对应的事实依据,那么如何确认抽象出这些事实依据,或者说如何更好的描述事物?
		 * 2:如何辩证事物描述的真伪.
		 * 3:如何建立事物的逻辑
		 * 	组织,排序,命令,测量,监督,评估,改进.
		 * 4:什么是逻辑
		 * 	清晰高效的思考
		 * 	通过事实来描述事实,尽量少的建立假设.
		 * 5:如何建立逻辑思维的框架?
		 * */
		
		/**
		 * 缺点:
		 * 有点像一个流水帐,
		 * 一些描述散乱:没有在文中统一专属名词.
		 * 一些描述表达的很模糊:名词定义了,但是还是不明白原因或含义不明觉厉的话但是追究起来却含义不明.
		 * 从结构上来说,文章没有连贯性,没有美感
		 * 按照道理来说,应该是如何建立一个逻辑框架,如何使用这个框架,最后验证这个框架是正确的
		 * */
		/**
		 * 想法:
		 * 管理的基石是逻辑
		 * 		为什么这么说? 因为只有清晰的而描述出事物,才能让对方去了解自己想要做什么,沟通是管理中重要的一环.说他是基石,是因为逻辑贯穿到管理中的每一个过程中.
		 * 
		 * 读完后觉得这本书写的或者说翻译的很不好,所以这本书真的是瘸子中挑将军而已.
		 * 
		 * 自言自语:
		 * 		逻辑思维是一个工具,他能帮我解决很多问题并提高自己的工作效率,至于非逻辑思维我其实不想关心和了解,我只想了解如何建立逻辑思维框架而已.
		 * */
	}

}
